{
    "summary": {
        "total_requirements": 333,
        "duplicate_groups": 12,
        "similarity_threshold": 0.85
    },
    "duplicates": [
        [
            {
                "id": "FR-12",
                "text": "The system SHALL allow the job seeker to upload supplementary documents (i.e. certificate )"
            },
            {
                "id": "FR-21",
                "text": "The system SHALL allow the employer to upload supplementary documents (i.e. company registration certificate)"
            }
        ],
        [
            {
                "id": "FR-50",
                "text": "The system SHALL enforce strong password policies with configurable parameters."
            },
            {
                "id": "NFR-23",
                "text": "The system SHALL enforce strong password policies, including minimum length, complexity, and regular password changes."
            }
        ],
        [
            {
                "id": "FR-51",
                "text": "The system SHALL implement role-based access control to restrict access to features and data based on user roles."
            },
            {
                "id": "NFR-24",
                "text": "The system SHALL implement role-based access control (RBAC) to restrict access to features and data based on user roles."
            }
        ],
        [
            {
                "id": "FR-52",
                "text": "The system SHALL provide session management with configurable timeout settings."
            },
            {
                "id": "NFR-27",
                "text": "The system SHALL implement secure session management with appropriate timeout settings."
            }
        ],
        [
            {
                "id": "FR-53",
                "text": "The system SHALL maintain detailed access logs for security monitoring and auditing."
            },
            {
                "id": "NFR-25",
                "text": "The system SHALL maintain detailed access logs for all authentication and authorization events."
            }
        ],
        [
            {
                "id": "FR-54",
                "text": "The system SHALL provide a structured job posting form for employers to create job listings."
            },
            {
                "id": "FR-55",
                "text": "The system SHALL provide a structured job posting form that allows employers to add new job opportunities with the following fields: Job title, summary, and required skills (with support for file upload or copy/paste input) Contract type (e.g., full-time, part-time, training, project-based) Required education level Application deadline with an optional auto-close feature Work format selection (Physical with employment location, Online, or Hybrid) Gender, number of employees, etc Required languages and proficiency levels Link to the job if available. More detailed features on the job post to be provided."
            }
        ],
        [
            {
                "id": "FR-86",
                "text": "The system SHALL recommend suitable job seekers to employers based on job requirements and matching criteria."
            },
            {
                "id": "FR-90",
                "text": "The system SHALL provide employers with candidate recommendations for their job postings."
            }
        ],
        [
            {
                "id": "FR-108",
                "text": "The system SHOULD maintain audit trails of all data exchanges with government systems."
            },
            {
                "id": "NFR-38",
                "text": "The system SHALL maintain audit trails of all data access and modifications for compliance purposes."
            }
        ],
        [
            {
                "id": "FR-118",
                "text": "The system SHALL implement data retention policies for activity logs in compliance with regulations."
            },
            {
                "id": "NFR-135",
                "text": "The system SHALL maintain log retention policies in compliance with legal requirements."
            }
        ],
        [
            {
                "id": "FR-132",
                "text": "The system SHOULD provide dashboards for administrators to monitor system health and performance."
            },
            {
                "id": "NFR-136",
                "text": "The system SHALL provide dashboards for monitoring system status and performance metrics."
            }
        ],
        [
            {
                "id": "FR-170",
                "text": "The system SHALL provide context-sensitive help throughout the platform."
            },
            {
                "id": "NFR-77",
                "text": "The system SHALL provide context-sensitive help and guidance."
            }
        ],
        [
            {
                "id": "NFR-16",
                "text": "The system SHALL be designed to scale horizontally by adding more server instances to handle increased load."
            },
            {
                "id": "NFR-17",
                "text": "The system SHALL be designed to scale vertically by utilizing additional resources on existing servers."
            }
        ]
    ]
}