[
    {
        "id": "FR-01",
        "original": "The system SHALL provide a self-registration process for job seekers.",
        "rewritten": "The system SHALL provide a self-registration process for job seekers."
    },
    {
        "id": "FR-22",
        "original": "The system SHALL provide a registration and onboarding process for external job sites.",
        "rewritten": "The system SHALL provide a registration and onboarding process for external job sites."
    },
    {
        "id": "FR-23",
        "original": "The system SHOULD issue a unique API key or token to each partner for secure access, with support for optional IP whitelisting, usage limits, and token expiration management to ensure controlled and secure integration.",
        "rewritten": "The system SHALL SHOULD issue a unique API key or token to each partner for secure access, with support for optional IP whitelisting, usage limits, and token expiration management to ensure controlled and secure integration."
    },
    {
        "id": "FR-24",
        "original": "The system SHOULD support job posting via a secure RESTful Push API, allowing external platforms to submit job opportunities directly to the job matching system.",
        "rewritten": "The system SHALL SHOULD support job posting via a secure RESTful Push API, allowing external platforms to submit job opportunities directly to the job matching system."
    },
    {
        "id": "FR-26",
        "original": "The system SHOULD provide a testing environment for external job sites to validate their integration.",
        "rewritten": "The system SHALL SHOULD provide a testing environment for external job sites to validate their integration."
    },
    {
        "id": "FR-27",
        "original": "The system SHOULD implement comprehensive error handling and response logging by providing clear API response codes with descriptive messages for success, failure, duplicates, and validation errors.",
        "rewritten": "The system SHALL SHOULD implement comprehensive error handling and response logging by providing clear API response codes with descriptive messages for success, failure, duplicates, and validation errors."
    },
    {
        "id": "FR-28",
        "original": "The system SHOULD grant external platforms access to view submission logs for monitoring and troubleshooting purposes.",
        "rewritten": "The system SHALL SHOULD grant external platforms access to view submission logs for monitoring and troubleshooting purposes."
    },
    {
        "id": "FR-29",
        "original": "The system SHOULD return a unique job ID as a confirmation response after a job is successfully pushed via the API, enabling accurate record-keeping and integration synchronization for external systems.",
        "rewritten": "The system SHALL SHOULD return a unique job ID as a confirmation response after a job is successfully pushed via the API, enabling accurate record-keeping and integration synchronization for external systems."
    },
    {
        "id": "FR-31",
        "original": "The system SHOULD support job synchronization of updates via the API, enabling external job sites to modify job details—such as deadline extensions, description edits, or early closure/deletion/deactivation—using the assigned job ID.",
        "rewritten": "The system SHALL support job synchronization via the API for external job sites to modify job details."
    },
    {
        "id": "FR-32",
        "original": "The system SHOULD provide an optional sync dashboard—a lightweight web interface or endpoint—that allows partners to review the status of jobs posted via the API, including indicators for synced, failed, pending, and archived records.",
        "rewritten": "The system SHALL SHOULD offer an optional sync dashboard for partners to review job statuses."
    },
    {
        "id": "FR-33",
        "original": "The system SHOULD also offer periodic or real-time access to integration usage statistics—such as the number of jobs submitted, matched, and viewed—for transparency, performance tracking, and reporting purposes.",
        "rewritten": "The system SHALL SHOULD provide periodic or real-time access to integration usage statistics."
    },
    {
        "id": "FR-34",
        "original": "The system SHOULD provide access to the up-to-date API schema (e.g., via Swagger) and detailed field validation rules to ensure proper formatting and structure of job postings submitted through the API.",
        "rewritten": "The system SHALL provide access to the up-to-date API schema and detailed field validation rules."
    },
    {
        "id": "FR-35",
        "original": "The system SHOULD provide an option for source platforms to configure whether their attribution (e.g., source platform name) appears publicly on job postings or is only visible within the admin panel and system logs.",
        "rewritten": "The system SHALL SHOULD allow source platforms to configure attribution visibility."
    },
    {
        "id": "FR-36",
        "original": "The system SHOULD maintain an audit trail at the job level, recording which external job site created or modified each posting, and display this information within the MoL admin dashboard for traceability and accountability.",
        "rewritten": "The system SHALL maintain an audit trail for job level modifications."
    },
    {
        "id": "FR-45",
        "original": "The system SHALL allow administrators to oversee job offerings by viewing active and inactive postings, changes in posts, and to suspend or remove job offerings that are deemed inappropriate or violate platform policies.",
        "rewritten": "The system SHALL oversee job offerings by viewing active and inactive postings, changes, and suspensions."
    },
    {
        "id": "FR-55",
        "original": "The system SHALL provide a structured job posting form that allows employers to add new job opportunities with the following fields: Job title, summary, and required skills (with support for file upload or copy/paste input) Contract type (e.g., full-time, part-time, training, project-based) Required education level Application deadline with an optional auto-close feature Work format selection (Physical with employment location, Online, or Hybrid) Gender, number of employees, etc Required languages and proficiency levels Link to the job if available. More detailed features on the job post to be provided.",
        "rewritten": "The system SHALL provide a structured job posting form with required fields."
    },
    {
        "id": "FR-56",
        "original": "The system SHALL support standardized job categories, skills, and qualifications to facilitate accurate matching. For this requirement, the system SHALL ensure that all input data complies with the Schema.org JobPosting standard for semantic compatibility and structured data integrity.",
        "rewritten": "The system SHALL support standardized job categories, skills, and qualifications to facilitate accurate matching."
    },
    {
        "id": "FR-63",
        "original": "The system SHALL display search results with relevance/skills-matching ranking and sorting options. In addition, when user login the system SHALL display recommended jobs based on results generated by AI matching engine.",
        "rewritten": "The system SHALL display search results with relevance/skills-matching ranking and sorting options."
    },
    {
        "id": "FR-67",
        "original": "The system SHALL provide employers with tools to manage the status of job postings.",
        "rewritten": "The system SHALL provide employers with tools to manage the status of job postings."
    },
    {
        "id": "FR-71",
        "original": "The system SHALL use a scoring algorithm to calculate a match score between job seekers and job postings minimally based on the following criteria: Skill overlap Education match Training match Location match Experience range Salary expectation range",
        "rewritten": "The system SHALL use a scoring algorithm to calculate a match score between job seekers and job postings minimally based on the following criteria: Skill overlap, Education match, Training match, Location match, Experience range, Salary expectation range."
    },
    {
        "id": "FR-76",
        "original": "The system SHALL rank/order job postings for each job seeker based on their individual match percentage, displaying the most relevant opportunities first.",
        "rewritten": "The system SHALL rank/order job postings for each job seeker based on their individual match percentage, displaying the most relevant opportunities first."
    },
    {
        "id": "FR-83",
        "original": "The system SHALL provide confidence scores for extracted information and highlight areas that may need manual verification.",
        "rewritten": "The system SHALL provide confidence scores for extracted information and highlight areas that may need manual verification."
    },
    {
        "id": "FR-98",
        "original": "The system SHOULD provide APIs for real-time job data synchronization with external job sites.",
        "rewritten": "The system SHALL SHOULD provide APIs for real-time job data synchronization with external job sites."
    },
    {
        "id": "FR-99",
        "original": "The system SHOULD implement data mapping and transformation to standardize job postings from different sources.",
        "rewritten": "The system SHALL SHOULD implement data mapping and transformation to standardize job postings from different sources."
    },
    {
        "id": "FR-100",
        "original": "The system SHOULD support both pull (importing jobs from external sites) and push (exporting jobs to external sites) integration models.",
        "rewritten": "The system SHALL support both pull (importing jobs from external sites) and push (exporting jobs to external sites) integration models."
    },
    {
        "id": "FR-101",
        "original": "The system SHOULD maintain synchronization logs and provide error handling for failed integrations.",
        "rewritten": "The system SHALL maintain synchronization logs and provide error handling for failed integrations."
    },
    {
        "id": "FR-102",
        "original": "The system SHOULD support scheduled and on-demand synchronization options.",
        "rewritten": "The system SHALL support scheduled and on-demand synchronization options."
    },
    {
        "id": "FR-103",
        "original": "The system SHOULD provide a dashboard to monitor integration status and data flow with external job sites.",
        "rewritten": "The system SHALL provide a dashboard to monitor integration status and data flow with external job sites."
    },
    {
        "id": "FR-104",
        "original": "The system SHOULD integrate with relevant government databases for data verification and enrichment.",
        "rewritten": "The system SHALL integrate with relevant government databases for data verification and enrichment."
    },
    {
        "id": "FR-105",
        "original": "The system SHOULD support integration with the MoL and PEF existing databases and systems.",
        "rewritten": "The system SHALL support integration with the MoL and PEF existing databases and systems."
    },
    {
        "id": "FR-106",
        "original": "The system SHOULD support verification of educational credentials through integration with educational institution databases.",
        "rewritten": "The system SHALL support verification of educational credentials through integration with educational institution databases."
    },
    {
        "id": "FR-107",
        "original": "The system SHOULD provide options for identity verification through government ID systems.",
        "rewritten": "The system SHALL provide options for identity verification through government ID systems."
    },
    {
        "id": "FR-108",
        "original": "The system SHOULD maintain audit trails of all data exchanges with government systems.",
        "rewritten": "The system SHALL maintain audit trails of all data exchanges with government systems."
    },
    {
        "id": "FR-109",
        "original": "The system SHOULD respect data privacy regulations when accessing and using government data.",
        "rewritten": "The system SHALL respect data privacy regulations when accessing and using government data."
    },
    {
        "id": "FR-110",
        "original": "The system SHOULD provide a comprehensive API framework for integration with external systems.",
        "rewritten": "The system SHALL provide a comprehensive API framework for integration with external systems."
    },
    {
        "id": "FR-111",
        "original": "The system SHOULD implement RESTful APIs with JSON data format as the primary integration method.",
        "rewritten": "The system SHALL implement RESTful APIs with JSON data format as the primary integration method."
    },
    {
        "id": "FR-112",
        "original": "The system SHOULD provide detailed API documentation with examples and testing tools.",
        "rewritten": "The system SHALL provide detailed API documentation with examples and testing tools."
    },
    {
        "id": "FR-113",
        "original": "The system SHOULD implement OAuth 2.0 for API authentication and authorization.",
        "rewritten": "The system SHALL implement OAuth 2."
    },
    {
        "id": "FR-114",
        "original": "The system SHOULD support API versioning to ensure backward compatibility.",
        "rewritten": "The system SHALL support API versioning to ensure backward compatibility."
    },
    {
        "id": "FR-119",
        "original": "MOL Life dashboard should include current logins, number of current logins and last sessions, with links to these users profiles",
        "rewritten": "The system SHALL MOL Life dashboard shall include current logins, number of current logins and last sessions, with links to these users profiles."
    },
    {
        "id": "FR-120",
        "original": "The system SHOULD generate employment statistics and labor market insights from platform data.",
        "rewritten": "The system SHALL generate employment statistics and labor market insights from platform data."
    },
    {
        "id": "FR-121",
        "original": "The system SHOULD track key metrics including job posting trends, application rates, hiring rates, and time-to-fill.",
        "rewritten": "The system SHALL track key metrics including job posting trends, application rates, hiring rates, and time-to-fill."
    },
    {
        "id": "FR-122",
        "original": "The system SHOULD provide industry-specific analytics on job market demand and supply.",
        "rewritten": "The system SHALL provide industry-specific analytics on job market demand and supply."
    },
    {
        "id": "FR-123",
        "original": "The system SHOULD analyze skill demand trends to identify emerging requirements and skill gaps.",
        "rewritten": "The system SHALL analyze skill demand trends to identify emerging requirements and skill gaps."
    },
    {
        "id": "FR-124",
        "original": "The system SHOULD generate geographic distribution reports for jobs and candidates.",
        "rewritten": "The system SHALL generate geographic distribution reports for jobs and candidates."
    },
    {
        "id": "FR-125",
        "original": "The system SHOULD provide salary range analytics by industry, position, and location.",
        "rewritten": "The system SHALL provide salary range analytics by industry, position, and location."
    },
    {
        "id": "FR-126",
        "original": "The system SHOULD track employment outcomes and career progression where data is available.",
        "rewritten": "The system SHALL track employment outcomes and career progression where data is available."
    },
    {
        "id": "FR-127",
        "original": "The system SHOULD generate periodic labor market reports for government stakeholders.",
        "rewritten": "The system SHALL generate periodic labor market reports for government stakeholders."
    },
    {
        "id": "FR-128",
        "original": "The system SHOULD monitor and report on system performance metrics.",
        "rewritten": "The system SHALL monitor and report on system performance metrics."
    },
    {
        "id": "FR-129",
        "original": "The system SHOULD track matching algorithm performance including accuracy, precision, recall, and user satisfaction.",
        "rewritten": "The system SHALL track matching algorithm performance including accuracy, precision, recall, and user satisfaction."
    },
    {
        "id": "FR-130",
        "original": "The system SHOULD monitor system usage patterns including peak times, popular features, and user engagement.",
        "rewritten": "The system SHALL monitor system usage patterns including peak times, popular features, and user engagement."
    },
    {
        "id": "FR-131",
        "original": "The system SHOULD track technical performance metrics including response times, resource utilization, and error rates.",
        "rewritten": "The system SHALL monitor technical performance metrics including response times, resource utilization, and error rates."
    },
    {
        "id": "FR-132",
        "original": "The system SHOULD provide dashboards for administrators to monitor system health and performance.",
        "rewritten": "The system SHALL provide dashboards for administrators to monitor system health and performance."
    },
    {
        "id": "FR-133",
        "original": "The system SHOULD generate alerts for performance issues or anomalies.",
        "rewritten": "The system SHALL generate alerts for performance issues or anomalies."
    },
    {
        "id": "FR-134",
        "original": "The system SHOULD maintain historical performance data for trend analysis and capacity planning.",
        "rewritten": "The system SHALL maintain historical performance data for trend analysis and capacity planning."
    },
    {
        "id": "FR-135",
        "original": "The system SHOULD provide a flexible reporting framework for generating custom reports through seamless integration with existing and available reporting tools such as Microsoft Power BI.",
        "rewritten": "The system SHALL provide a flexible reporting framework for generating custom reports through seamless integration with existing and available reporting tools such as Microsoft Power BI."
    },
    {
        "id": "FR-136",
        "original": "The system SHOULD allow administrators to define report templates with configurable parameters.",
        "rewritten": "The system SHALL allow administrators to define report templates with configurable parameters."
    },
    {
        "id": "FR-137",
        "original": "The system SHOULD support various report formats including tabular data, charts, and visualizations.",
        "rewritten": "The system SHALL support various report formats including tabular data, charts, and visualizations."
    },
    {
        "id": "FR-138",
        "original": "The system SHOULD allow scheduling of recurring reports with automated distribution.",
        "rewritten": "The system SHALL allow scheduling of recurring reports with automated distribution."
    },
    {
        "id": "FR-139",
        "original": "The system SHOULD support export of reports in common formats (PDF, Excel, CSV).",
        "rewritten": "The system SHALL support export of reports in common formats (PDF, Excel, CSV)."
    },
    {
        "id": "FR-140",
        "original": "The system SHOULD provide a report builder interface for users with appropriate permissions.",
        "rewritten": "The system SHALL provide a report builder interface for users with appropriate permissions."
    },
    {
        "id": "FR-141",
        "original": "The system SHOULD maintain a library of saved reports for quick access.",
        "rewritten": "The system SHALL maintain a library of saved reports for quick access."
    },
    {
        "id": "FR-142",
        "original": "The system SHOULD implement access controls to ensure users can only view reports appropriate to their role.",
        "rewritten": "The system SHALL implement access controls to ensure users can only view reports appropriate to their role."
    },
    {
        "id": "FR-154",
        "original": "The system SHALL support different notification types with appropriate visual indicators.",
        "rewritten": "The system SHALL support different notification types with appropriate visual indicators."
    },
    {
        "id": "NFR-08",
        "original": "The system SHALL process at least 100 job applications per minute during peak periods.",
        "rewritten": "The system SHALL process at least 100 job applications per minute during peak periods.  # fallback"
    },
    {
        "id": "NFR-14",
        "original": "The system SHALL optimize database queries to minimize I/O operations and response times.",
        "rewritten": "The system SHALL optimize database queries to minimize I/O operations and response times.  # fallback"
    },
    {
        "id": "NFR-15",
        "original": "The system SHALL implement caching mechanisms to reduce resource utilization for frequently accessed data.",
        "rewritten": "The system SHALL implement caching mechanisms to reduce resource utilization for frequently accessed data.  # fallback"
    },
    {
        "id": "NFR-27",
        "original": "The system SHALL implement secure session management with appropriate timeout settings.",
        "rewritten": "The system SHALL implement the system shall comply with security standards session management with appropriate timeout settings.  # fallback"
    },
    {
        "id": "NFR-35",
        "original": "The system SHALL maintain separate environments for development, testing, and production with appropriate data isolation.",
        "rewritten": "The system SHALL maintain separate environments for development, testing, and production with appropriate data isolation.  # fallback"
    },
    {
        "id": "NFR-40",
        "original": "The system SHALL provide clear privacy notices and obtain appropriate consent for data collection and processing.",
        "rewritten": "The system SHALL provide clear privacy notices and obtain appropriate consent for data collection and processing.  # fallback"
    },
    {
        "id": "NFR-68",
        "original": "The system SHALL handle input validation errors gracefully, providing clear feedback to users.",
        "rewritten": "The system SHALL handle input validation errors gracefully, providing clear feedback to users.  # fallback"
    },
    {
        "id": "NFR-69",
        "original": "The system SHALL implement appropriate retry mechanisms for transient errors.",
        "rewritten": "The system SHALL implement appropriate retry mechanisms for transient errors.  # fallback"
    },
    {
        "id": "NFR-75",
        "original": "The system SHALL provide appropriate feedback for user actions.",
        "rewritten": "The system SHALL provide appropriate feedback for user actions.  # fallback"
    },
    {
        "id": "NFR-81",
        "original": "The system SHALL ensure sufficient color contrast for text and interactive elements.",
        "rewritten": "The system SHALL ensure sufficient color contrast for text and interactive elements.  # fallback"
    },
    {
        "id": "NFR-88",
        "original": "The system SHALL ensure that date, time, and number formats are appropriate for the selected language and locale.",
        "rewritten": "The system SHALL ensure that date, time, and number formats are appropriate for the selected language and locale.  # fallback"
    },
    {
        "id": "NFR-91",
        "original": "The system SHALL implement language detection to suggest the appropriate language based on user settings and location.",
        "rewritten": "The system SHALL implement language detection to suggest the appropriate language based on user settings and location.  # fallback"
    },
    {
        "id": "NFR-98",
        "original": "The system SHALL provide appropriate defaults to reduce the need for user configuration.",
        "rewritten": "The system SHALL provide appropriate defaults to reduce the need for user configuration.  # fallback"
    },
    {
        "id": "NFR-121",
        "original": "The system SHALL maintain appropriate records for regulatory compliance and auditing.",
        "rewritten": "The system SHALL maintain appropriate records for regulatory compliance and auditing.  # fallback"
    },
    {
        "id": "NFR-125",
        "original": "The system SHALL provide appropriate attribution for third-party content.",
        "rewritten": "The system SHALL provide appropriate attribution for third-party content.  # fallback"
    },
    {
        "id": "NFR-156",
        "original": "The system SHALL use appropriate terminology and language for the local context.",
        "rewritten": "The system SHALL use appropriate terminology and language for the local context.  # fallback"
    },
    {
        "id": "NFR-157",
        "original": "The system SHALL support local date and time formats, including Hijri calendar references where appropriate.",
        "rewritten": "The system SHALL support local date and time formats, including Hijri calendar references where appropriate.  # fallback"
    },
    {
        "id": "NFR-161",
        "original": "The system SHALL implement appropriate content moderation policies for politically sensitive content.",
        "rewritten": "The system SHALL implement appropriate content moderation policies for politically sensitive content.  # fallback"
    }
]